GreatCowBASIC/DATFileGenerator/incfiles/p18lf56k42.inc
;----- DMA1SPTRU Bits -----------------------------------------------------
SPTR16           EQU  H'0000'
SPTR17           EQU  H'0001'
SPTR18           EQU  H'0002'
SPTR19           EQU  H'0003'
SPTR20           EQU  H'0004'
SPTR21           EQU  H'0005'


DMA1SPTR16       EQU  H'0000'
DMA1SPTR17       EQU  H'0001'
DMA1SPTR18       EQU  H'0002'
DMA1SPTR19       EQU  H'0003'
DMA1SPTR20       EQU  H'0004'
DMA1SPTR21       EQU  H'0005'


;----- DMA1SSZL Bits -----------------------------------------------------
SSZ0             EQU  H'0000'
SSZ1             EQU  H'0001'
SSZ2             EQU  H'0002'
SSZ3             EQU  H'0003'
SSZ4             EQU  H'0004'
SSZ5             EQU  H'0005'
SSZ6             EQU  H'0006'
SSZ7             EQU  H'0007'

DMA1SSZ0         EQU  H'0000'
DMA1SSZ1         EQU  H'0001'
DMA1SSZ2         EQU  H'0002'
DMA1SSZ3         EQU  H'0003'
DMA1SSZ4         EQU  H'0004'
DMA1SSZ5         EQU  H'0005'
DMA1SSZ6         EQU  H'0006'
DMA1SSZ7         EQU  H'0007'


;----- DMA1SSZH Bits -----------------------------------------------------
SSZ8             EQU  H'0000'
SSZ9             EQU  H'0001'
SSZ10            EQU  H'0002'
SSZ11            EQU  H'0003'

DMA1SSZ8         EQU  H'0000'
DMA1SSZ9         EQU  H'0001'
DMA1SSZ10        EQU  H'0002'
DMA1SSZ11        EQU  H'0003'


;----- DMA1SSAL Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


DMA1SSA0         EQU  H'0000'
DMA1SSA1         EQU  H'0001'
DMA1SSA2         EQU  H'0002'
DMA1SSA3         EQU  H'0003'
DMA1SSA4         EQU  H'0004'
DMA1SSA5         EQU  H'0005'
DMA1SSA6         EQU  H'0006'
DMA1SSA7         EQU  H'0007'


;----- DMA1SSAH Bits -----------------------------------------------------
SSA8             EQU  H'0000'
SSA9             EQU  H'0001'
SSA10            EQU  H'0002'
SSA11            EQU  H'0003'
SSA12            EQU  H'0004'
SSA13            EQU  H'0005'
SSA14            EQU  H'0006'
SSA15            EQU  H'0007'


DMA1SSA8         EQU  H'0000'
DMA1SSA9         EQU  H'0001'
DMA1SSA10        EQU  H'0002'
DMA1SSA11        EQU  H'0003'
DMA1SSA12        EQU  H'0004'
DMA1SSA13        EQU  H'0005'
DMA1SSA14        EQU  H'0006'
DMA1SSA15        EQU  H'0007'


;----- DMA1SSAU Bits -----------------------------------------------------
SSA16            EQU  H'0000'
SSA17            EQU  H'0001'
SSA18            EQU  H'0002'
SSA19            EQU  H'0003'
SSA20            EQU  H'0004'
SSA21            EQU  H'0005'


DMA1SSA16        EQU  H'0000'
DMA1SSA17        EQU  H'0001'
DMA1SSA18        EQU  H'0002'
DMA1SSA19        EQU  H'0003'
DMA1SSA20        EQU  H'0004'
DMA1SSA21        EQU  H'0005'


;----- DMA1CON0 Bits -----------------------------------------------------
XIP              EQU  H'0000'
AIRQEN           EQU  H'0002'
DGO              EQU  H'0005'
SIRQEN           EQU  H'0006'
EN               EQU  H'0007'

DMA1XIP          EQU  H'0000'
DMA1AIRQEN       EQU  H'0002'
DMA1DGO          EQU  H'0005'
DMA1SIRQEN       EQU  H'0006'
DMA1EN           EQU  H'0007'


;----- DMA1CON1 Bits -----------------------------------------------------
SSTP             EQU  H'0000'
DSTP             EQU  H'0005'


;----- DMA1AIRQ Bits -----------------------------------------------------
AIRQ0            EQU  H'0000'
AIRQ1            EQU  H'0001'
AIRQ2            EQU  H'0002'
AIRQ3            EQU  H'0003'
AIRQ4            EQU  H'0004'
AIRQ5            EQU  H'0005'
AIRQ6            EQU  H'0006'

DMA1AIRQ0        EQU  H'0000'
DMA1AIRQ1        EQU  H'0001'
DMA1AIRQ2        EQU  H'0002'
DMA1AIRQ3        EQU  H'0003'
DMA1AIRQ4        EQU  H'0004'
DMA1AIRQ5        EQU  H'0005'
DMA1AIRQ6        EQU  H'0006'


;----- DMA1SIRQ Bits -----------------------------------------------------
SIRQ0            EQU  H'0000'
SIRQ1            EQU  H'0001'
SIRQ2            EQU  H'0002'
SIRQ3            EQU  H'0003'
SIRQ4            EQU  H'0004'
SIRQ5            EQU  H'0005'
SIRQ6            EQU  H'0006'

DMA1SIRQ0        EQU  H'0000'
DMA1SIRQ1        EQU  H'0001'
DMA1SIRQ2        EQU  H'0002'
DMA1SIRQ3        EQU  H'0003'
DMA1SIRQ4        EQU  H'0004'
DMA1SIRQ5        EQU  H'0005'
DMA1SIRQ6        EQU  H'0006'


;----- CLC1CON Bits -----------------------------------------------------
INTN_CLC1CON     EQU  H'0003'
INTP_CLC1CON     EQU  H'0004'
OUT_CLC1CON      EQU  H'0005'
OE               EQU  H'0006'
EN               EQU  H'0007'

MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'

LC1INTN          EQU  H'0003'
LC1INTP          EQU  H'0004'
LC1OUT           EQU  H'0005'
LC1OE            EQU  H'0006'
LC1EN            EQU  H'0007'

LC1MODE0         EQU  H'0000'
LC1MODE1         EQU  H'0001'
LC1MODE2         EQU  H'0002'


;----- CLC1POL Bits -----------------------------------------------------
G1POL            EQU  H'0000'
G2POL            EQU  H'0001'
G3POL            EQU  H'0002'
G4POL            EQU  H'0003'
POL_CLC1POL      EQU  H'0007'

LC1G1POL         EQU  H'0000'
LC1G2POL         EQU  H'0001'
LC1G3POL         EQU  H'0002'
LC1G4POL         EQU  H'0003'
LC1POL           EQU  H'0007'


;----- CLC1SEL0 Bits -----------------------------------------------------
D1S0             EQU  H'0000'
D1S1             EQU  H'0001'
D1S2             EQU  H'0002'
D1S3             EQU  H'0003'
D1S4             EQU  H'0004'
D1S5             EQU  H'0005'
D1S6             EQU  H'0006'
D1S7             EQU  H'0007'

LC1D1S0          EQU  H'0000'
LC1D1S1          EQU  H'0001'
LC1D1S2          EQU  H'0002'
LC1D1S3          EQU  H'0003'
LC1D1S4          EQU  H'0004'
LC1D1S5          EQU  H'0005'
LC1D1S6          EQU  H'0006'
LC1D1S7          EQU  H'0007'


;----- CLC1SEL1 Bits -----------------------------------------------------
D2S0             EQU  H'0000'
D2S1             EQU  H'0001'
D2S2             EQU  H'0002'
D2S3             EQU  H'0003'
D2S4             EQU  H'0004'
D2S5             EQU  H'0005'
D2S6             EQU  H'0006'
D2S7             EQU  H'0007'

LC1D2S0          EQU  H'0000'
LC1D2S1          EQU  H'0001'
LC1D2S2          EQU  H'0002'
LC1D2S3          EQU  H'0003'
LC1D2S4          EQU  H'0004'
LC1D2S5          EQU  H'0005'
LC1D2S6          EQU  H'0006'
LC1D2S7          EQU  H'0007'


